# Задача "За честь и отвагу!":
#
# Создайте класс Knight, наследованный от Thread, объекты которого будут обладать
# следующими свойствами:
#
# 1. Атрибут name - имя рыцаря. (str)
# 2. Атрибут power - сила рыцаря. (int)
#
# А также метод run, в котором рыцарь будет сражаться с врагами:
#
# 1. При запуске потока должна выводится надпись "<Имя рыцаря>, на нас напали!".
# 2. Рыцарь сражается до тех пор, пока не повергнет всех врагов (у всех потоков
# их 100).
# 3. В процессе сражения количество врагов уменьшается на power текущего рыцаря.
# 4. По прошествию 1 дня сражения (1 секунды) выводится строка
# "<Имя рыцаря> сражается <кол-во дней>..., осталось <кол-во воинов> воинов."
# 5. После победы над всеми врагами выводится надпись
# "<Имя рыцаря> одержал победу спустя <кол-во дней> дней(дня)!"
#
# Как можно заметить нужно сделать задержку в 1 секунду, инструменты для задержки
# выберите сами.
#
# Пункты задачи:
#
# 1. Создайте класс Knight с соответствующими описанию свойствами.
# 2. Создайте и запустите 2 потока на основе класса Knight.
# 3. Выведите на экран строку об окончании битв.
#
#
# Пример результата выполнения программы:
# Алгоритм выполнения кода:
# # Создание класса
# first_knight = Knight('Sir Lancelot', 10)
# second_knight = Knight("Sir Galahad", 20)
#
# # Запуск потоков и остановка текущего
# # Вывод строки об окончании сражения
# Вывод на консоль:
# Sir Lancelot, на нас напали!
# Sir Lancelot, сражается 1 день(дня)..., осталось 90 воинов.
# Sir Galahad, на нас напали!
# Sir Galahad, сражается 1 день(дня)..., осталось 80 воинов.
# Sir Galahad, сражается 2 день(дня)..., осталось 60 воинов.
# Sir Lancelot, сражается 2 день(дня)..., осталось 80 воинов.
# Sir Lancelot, сражается 3 день(дня)..., осталось 70 воинов.
# Sir Galahad, сражается 3 день(дня)..., осталось 40 воинов.
# Sir Lancelot, сражается 4 день(дня)..., осталось 60 воинов.
# Sir Galahad, сражается 4 день(дня)..., осталось 20 воинов.
# Sir Galahad, сражается 5 день(дня)..., осталось 0 воинов.
# Sir Lancelot, сражается 5 день(дня)..., осталось 50 воинов.
# Sir Lancelot, сражается 6 день(дня)..., осталось 40 воинов.
# Sir Galahad одержал победу спустя 5 дней(дня)!
# Sir Lancelot, сражается 7 день(дня)..., осталось 30 воинов.
# Sir Lancelot, сражается 8 день(дня)..., осталось 20 воинов.
# Sir Lancelot, сражается 9 день(дня)..., осталось 10 воинов.
# Sir Lancelot, сражается 10 день(дня)..., осталось 0 воинов.
# Sir Lancelot одержал победу спустя 10 дней(дня)!
# Все битвы закончились!

import threading
from time import sleep


class Knight(threading.Thread):
    def __init__(
            self,
            name: str,
            power: int
    ):
        super().__init__()
        self.name = name
        self.power = power
        self.enemies = 100

    @staticmethod
    def battle(name, power, enemies):
        days = 0
        enemies = enemies
        while enemies > 0:
            days += 1
            enemies -= power
            if enemies < 0:
                enemies = 0
            sleep(0.1)
            print(f'{name}, сражается {days} день(дня)..., '
                  f'осталось {enemies} воинов')
        return days

    def run(self) -> None:
        print(f'{self.name}, на нас напали!')
        days = self.battle(self.name, self.power, self.enemies)
        print(f'{self.name} одержал победу спустя {days} дней(дня)!"')


first_knight = Knight('Sir Lancelot', 10)
second_knight = Knight("Sir Galahad", 20)

for knight in (first_knight, second_knight):
    knight.start()

for knight in (first_knight, second_knight):
    knight.join()

print('Все битвы закончились!')