# Цель задания:
#
# Освоить навык создания виртуальных окружений в Python.
#
# Практически применить знания, загрузив проект с GitHub и установить требуемые
# библиотеки.
#
# Задание:
#
# 1. Необходимо создать пустой проект в PyCharm и клонировать репозиторий -
# https://github.com/yanchuki/pygame_example.git
# 2. Создать новое виртуальное окружение (назвать на своё усмотрение) и сделать его
# главным для проекта.
# 3. Активировать новое виртуальное окружение в консоли, предварительно
# деактивировав старое.
# 4. В новое виртуальное окружение загрузить необходимые пакеты при помощи файла
# зависимостей - requirements.txt. Сделать это можно следующей командой -
# pip install -r requirements.txt
# 5. Проверить работу программы.
#
# Программа рисует круги разной формы и цвета при нажатии на мышку с каждой
# секундой.
#
# Результат работы (примерный):
#
# К домашнему заданию прикрепить:
#
# 1. Скриншоты древа проекта (развернутое). Должно присутствовать 2 окружения
# ('venv', 'ваше название')
# 2. Скриншот(-ы) с вызовами соответствующих pip - команд при выполнении ДЗ.
# 3. Рисунок получившийся у вас.